snlkuharlocal/src/Catalogs/ГТД/ГТД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ГТД</name>
  <hierarchical>true</hierarchical>
  <owners>Catalog.ИБ</owners>
  <attributes>
    <name>СтранаПроисхождения</name>
    <type>
      <types>CatalogRef.КлассификаторСтранМира</types>
    </type>
  </attributes>
  <attributes>
    <name>Примечание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>32</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Импортер</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
</mdclass:Catalog>

snlkuharlocal/src/Catalogs/ГТД/ObjectModule.bsl
Процедура ПередЗаписью(Отказ)
	// Лобан 010813 +++
	// Проверка на правильнное количество знаков в ГТД
	если СтрДлина(Наименование) = 23 тогда
		СтрДлинаЗначения = СтрДлина(Наименование);
		ПервоеЗначение = Найти(Наименование,"/");
		Если ПервоеЗначение <> 9 тогда
			Сообщить("Проверьте правильность первого сигмента ГТД");
			Отказ = Истина
		КонецЕсли;
		ВтороеЗначение = Найти(Прав(Наименование,СтрДлинаЗначения-ПервоеЗначение),"/"); 
		Если ВтороеЗначение <> 7 тогда
			Сообщить("Проверьте правильность второго сигмента ГТД");
			Отказ = Истина
		КонецЕсли;		
		//Кухарь 25.10.19 начало
		//Какие то странные ГТД, когда товар сделан в польше, но ввезён из Белорусии
	ИначеЕсли СтрДлина(Наименование) = 20  тогда
		СтрДлинаЗначения = СтрДлина(Наименование);
		ПервоеЗначение = Найти(Наименование,"/");
		Если ПервоеЗначение <> 6 тогда
			Сообщить("Проверьте правильность первого сегмента ГТД");
			Отказ = Истина                              
		КонецЕсли;
		ВтороеЗначение = Найти(Прав(Наименование,СтрДлинаЗначения-ПервоеЗначение),"/"); 
		Если ВтороеЗначение <> 7 тогда
			Сообщить("Проверьте правильность второго сегмента ГТД");
			отказ=Истина;
		КонецЕсли;      
		//Кухарь 25.10.19 конец
		
	иначе
		СтрДлинаЗначения = СтрДлина(Наименование);
		ПервоеЗначение = Найти(Наименование,"/");
		Если ПервоеЗначение <> 9 тогда
			Сообщить("Проверьте правильность первого сигмента ГТД");
			Отказ = Истина
		КонецЕсли;
		ВтороеЗначение = Найти(Прав(Наименование,СтрДлинаЗначения-ПервоеЗначение),"/"); 
		Если ВтороеЗначение <> 7 тогда
			Сообщить("Проверьте правильность второго сигмента ГТД");
			Отказ = Истина
		КонецЕсли;
		ТретиеЗначение = Найти(Прав(Наименование,СтрДлинаЗначения-ПервоеЗначение-ВтороеЗначение),"/");
		Если ТретиеЗначение <> 8 тогда
			Сообщить("Проверьте правильность третьего сигмента ГТД");
			Отказ = Истина
		КонецЕсли;
	КонецЕсли;
	// Лобан 010813 ---
	Если ЭтоНовый() И ЭтоГруппа Тогда
		Если НЕ ОбменДанными.Загрузка Тогда	
			Год = "20"+Сред(Наименование,14,2);
			Месяц =  Сред(Наименование,12,2);
			День =  Сред(Наименование,10,2);
			Попытка
				Если Дата("20000101000000") > Дата(Год+Месяц+День+"000000") ИЛИ Дата("21000101000000")< Дата(Год+Месяц+День+"000000") Тогда
					сообщить("неверный формат второго сегмента. Он должен соответствовать дате ГТД");
					Отказ = Истина;	
				КонецЕсли;
			Исключение
				сообщить("неверный формат второго сегмента. Он должен соответствовать дате ГТД");	
				Отказ = Истина;	
			КонецПопытки;
		КонецЕсли;
		//крохин начало 30.01.2013
		//обязательные поля для элемента - Страна и Импортер
	ИначеЕсли ЭтоНовый() И Не ЭтоГруппа Тогда
		Если НЕ ОбменДанными.Загрузка Тогда
			Если СтранаПроисхождения.Пустая() Тогда
				#Если Клиент Тогда
					Сообщить("не указана страна в ГТД, сохранение невозможно");
				#КонецЕсли
				Отказ = Истина;	
			КонецЕсли;
			Если Импортер.Пустая() Тогда
				#Если Клиент Тогда
					Сообщить("не указан импортер в ГТД, сохранение невозможно");
				#КонецЕсли
				Отказ = Истина;	
			КонецЕсли;
		КонецЕсли;
		//крохин конец 30.01.2013
		
	КонецЕсли;
	//крохин начало 31.05.2019
	//вместо авторегистрации изменений
	УстановитьПолучателейИзмененийОбъекта(ЭтотОбъект);
	//крохин конец 31.05.2019
	
	
	
КонецПроцедуры
